Syllabus/syllabus.org
#+title: Syllabus
#+author: Nathan Mull

#+MACRO: options (eval (if (org-export-derived-backend-p org-export-current-backend 'latex) "#+OPTIONS: toc:nil"))
#+OPTIONS: html-style:nil H:2 author:nil date:nil num:nil
{{{options}}}

#+LATEX_COMPILER: lualatex
#+LATEX_HEADER: \usepackage[headermark={CAS CS 392: Rust, in Practice and in Theory}]{nmmfancy}
#+LATEX: \thispagestyle{firstpage}

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myStyle.css" />
#+HTML_LINK_HOME: ../index.html

#+ATTR_LATEX: :align |l|l|
|------------------+-------------------------------------|
| Course Code      | CAS CS 392                          |
| Course Title     | Rust, in Practice and in Theory     |
| Semester         | Spring 2025                         |
| Instructor       | Nathan Mull                         |
| Meeting Time     | Tuesday and Thursday, 5:00PM-6:15PM |
| Meeting Location | CDS 364                             |
| Midterm Date     | March 6                             |
| Grade Breakdown  | 30% Assignments                     |
|                  | 40% Final Project                   |
|                  | 20% Midterm Exam                    |
|                  | 10% Participation                   |
|------------------+-------------------------------------|
#+LATEX: \bigskip


#+LATEX: \noindent
/CAS CS 392: Rust, in Practice and in Theory/ is a course about Rust,
a type-safe, memory-safe PL that is becoming a popular alternative to
C and C++ in settings where performance and memory usage are major
concerns.  It's self-described as having "high-level ergonomics" and
"low-level control". Practically speaking, this means clear, concise
code with fewer memory bugs.  Theoretically speaking, this means the
use of a rich type system based on the notion of linearity to enforce
memory-safety before any code has actually been run.

Despite its popularity, Rust is still daunting to learn, even for
experienced programmers.  There are several concepts in Rust that
don't appear in any other popular languages.  And even if you become a
proficient Rust programmer, you may not have a deep understanding how
Rust works, or why it is a better alternative to other low-level
languages.

In this course, we'll spend the first half of the semester learning
Rust.  We'll spend the second half implementing a subset of Rust /in
Rust/.  This will help us better understand the details of Rust's type
system and borrow checker.

* General Information

This course meets 5:00PM-6:15PM Tuesdays and Thursdays in CDS 364.
There are no labs/discussions for this course.  The course consists of
assignments, a midterm exam, a final project, and pre-lecture quizzes.

** Disclaimer

*Please read this section carefully.* This is a new course.  It's the
first time I'm offering it, it's on a quite modern topic and, to be
frank, I'm not sure how well it's going to go.  All of this is to say:
if you're looking for a streamlined course experience, then I don't
recommend taking this course.  This course will require a level of
academic independence and maturity that I expect of advanced
undergraduate students.  There's going to be experimentation, some
things that work, some things that don't, some things with bad
documentation, some things that will require you to look things up
outside of the course material (gasp).  But if you stick with the
course, I hope it can be a valuable experience for all of us.

** Course Structure

*Please read this section carefully.* This course will be treated as a
hybrid of a /flipped classroom/ and a /workshop/.  Each lecture will
have corresponding readings which you will be expected to have read
/before/ lecture, and which will be required to answer pre-lecture
quizzes.

The first part of lecture will be dedicated to a short overview of the
day's topic.  Each lecture will have corresponding discussion
questions.  /I want you to think of this part of lecture as closer to
your standard humanities course/.  It should be a high-participation
discussion, with live-coding and board work.  It's during this part
that you should make sure you're on the same page as everyone else
with respect to the material.

The second (primary) part will be dedicated to working with the
material from the reading.  This will almost always just mean working
on the homework assignments.  This means that homework assignments
will be long, but you will have lots of opportunities to work on it
with other students in the course and get help.  During this part, you
will be encouraged to work in groups of 2-4.  Ideally, you'll be able
to create a small group that you can work with consistently.  Of
course, this does not mean that you can cheat (see below for cheating
policies) but I want you all to help each other as much as possible.

*Lectures are required*.  You are allowed to miss a handful of
lectures due to conflicts, but the structure of this course only works
if you want to participate.  If you feel like you can't do this (be it
because of social anxiety, depression, family conflicts, etc.) then we
can have a conversation and see what other options there are.  But
this does mean that you have to advocate for yourself.

** Prerequisites

The formal requirements of this course are /CAS CS 320: Concepts of
Programming Languages/ and /CAS CS 210: Computer Systems/.  You'll
have the best time with this course if you took CS320 during the Fall
2024 semester.  It is not strictly a requirement, but if you didn't,
then you'll have to catch up a bit on the type theory part of the
course. We'll have a crash course on this after the spring recess, but
it will likely take some time and effort outside of class to master
this material.  Ideally, we should be able to create groups in which
at least one member has this experience.

The dependence on 210 is quite mild.  You need to be comfortable with
the terminal, and you need to have some sense of low-level memory
management.  That said, the more versed you are in systems, more
you'll get out of learning Rust.

