Syllabus/syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-16 Thu 17:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syllabus</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="../index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Syllabus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org208d311">General Information</a>
<ul>
<li><a href="#org5c4b6fa">Disclaimer</a></li>
<li><a href="#orgb824937">Course Structure</a></li>
<li><a href="#org3b24c73">Prerequisites</a></li>
<li><a href="#orgdccc61f">Learning Outcomes</a></li>
</ul>
</li>
<li><a href="#orga54e438">Evaluation</a>
<ul>
<li><a href="#orga21b5a7">Assignments</a></li>
<li><a href="#orgc7f07f4">Midterm Exam</a></li>
<li><a href="#org28d33a8">Final Project</a></li>
<li><a href="#org9b13634">Participation</a></li>
</ul>
</li>
<li><a href="#org3d14f29">Course Resources</a>
<ul>
<li><a href="#orgfd4ac10">Piazza</a></li>
<li><a href="#orgde62021">Gradescope</a></li>
</ul>
</li>
<li><a href="#org970e210">Policies</a>
<ul>
<li><a href="#org23b0e06">Collaboration</a></li>
<li><a href="#org89f32e4">Academic Integrity</a></li>
<li><a href="#orge30faa8">Disability Statement</a></li>
<li><a href="#orgcc08695">Diversity Statement</a></li>
<li><a href="#org7d40b4b">Sexual Misconduct</a></li>
<li><a href="#org555a07a">A Comment on Generative AI</a></li>
</ul>
</li>
<li><a href="#orgb281245">Student Resources</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Course Code</td>
<td class="org-left">CAS CS 392</td>
</tr>

<tr>
<td class="org-left">Course Title</td>
<td class="org-left">Rust, in Practice and in Theory</td>
</tr>

<tr>
<td class="org-left">Semester</td>
<td class="org-left">Spring 2025</td>
</tr>

<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Nathan Mull</td>
</tr>

<tr>
<td class="org-left">Meeting Time</td>
<td class="org-left">Tuesday and Thursday, 5:00PM-6:15PM</td>
</tr>

<tr>
<td class="org-left">Meeting Location</td>
<td class="org-left">CDS 364</td>
</tr>

<tr>
<td class="org-left">Midterm Date</td>
<td class="org-left">March 6</td>
</tr>

<tr>
<td class="org-left">Grade Breakdown</td>
<td class="org-left">30% Assignments</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">40% Final Project</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">20% Midterm Exam</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">10% Participation</td>
</tr>
</tbody>
</table>
<p>
<i>CAS CS 392: Rust, in Practice and in Theory</i> is a course about Rust,
a type-safe, memory-safe PL that is becoming a popular alternative to
C and C++ in settings where performance and memory usage are major
concerns.  It's self-described as having "high-level ergonomics" and
"low-level control". Practically speaking, this means clear, concise
code with fewer memory bugs.  Theoretically speaking, this means the
use of a rich type system based on the notion of linearity to enforce
memory-safety before any code has actually been run.
</p>

<p>
Despite its popularity, Rust is still daunting to learn, even for
experienced programmers.  There are several concepts in Rust that
don't appear in any other popular languages.  And even if you become a
proficient Rust programmer, you may not have a deep understanding how
Rust works, or why it is a better alternative to other low-level
languages.
</p>

<p>
In this course, we'll spend the first half of the semester learning
Rust.  We'll spend the second half implementing a subset of Rust <i>in
Rust</i>.  This will help us better understand the details of Rust's type
system and borrow checker.
</p>

<div id="outline-container-org208d311" class="outline-2">
<h2 id="org208d311">General Information</h2>
<div class="outline-text-2" id="text-org208d311">
<p>
This course meets 5:00PM-6:15PM Tuesdays and Thursdays in CDS 364.
There are no labs/discussions for this course.  The course consists of
assignments, a midterm exam, a final project, and pre-lecture quizzes.
</p>
</div>

<div id="outline-container-org5c4b6fa" class="outline-3">
<h3 id="org5c4b6fa">Disclaimer</h3>
<div class="outline-text-3" id="text-org5c4b6fa">
<p>
<b>Please read this section carefully.</b> This is a new course.  It's the
first time I'm offering it, it's on a quite modern topic and, to be
frank, I'm not sure how well it's going to go.  All of this is to say:
if you're looking for a streamlined course experience, then I don't
recommend taking this course.  This course will require a level of
academic independence and maturity that I expect of advanced
undergraduate students.  There's going to be experimentation, some
things that work, some things that don't, some things with bad
documentation, some things that will require you to look things up
outside of the course material (gasp).  But if you stick with the
course, I hope it can be a valuable experience for all of us.
</p>
</div>
</div>

<div id="outline-container-orgb824937" class="outline-3">
<h3 id="orgb824937">Course Structure</h3>
<div class="outline-text-3" id="text-orgb824937">
<p>
<b>Please read this section carefully.</b> This course will be treated as a
hybrid of a <i>flipped classroom</i> and a <i>workshop</i>.  Each lecture will
have corresponding readings which you will be expected to have read
<i>before</i> lecture, and which will be required to answer pre-lecture
quizzes.
</p>

<p>
The first part of lecture will be dedicated to a short overview of the
day's topic.  Each lecture will have corresponding discussion
questions.  <i>I want you to think of this part of lecture as closer to
your standard humanities course</i>.  It should be a high-participation
discussion, with live-coding and board work.  It's during this part
that you should make sure you're on the same page as everyone else
with respect to the material.
</p>

<p>
The second (primary) part will be dedicated to working with the
material from the reading.  This will almost always just mean working
on the homework assignments.  This means that homework assignments
will be long, but you will have lots of opportunities to work on it
with other students in the course and get help.  During this part, you
will be encouraged to work in groups of 2-4.  Ideally, you'll be able
to create a small group that you can work with consistently.  Of
course, this does not mean that you can cheat (see below for cheating
policies) but I want you all to help each other as much as possible.
</p>

<p>
<b>Lectures are required</b>.  You are allowed to miss a handful of
lectures due to conflicts, but the structure of this course only works
if you want to participate.  If you feel like you can't do this (be it
because of social anxiety, depression, family conflicts, etc.) then we
can have a conversation and see what other options there are.  But
this does mean that you have to advocate for yourself.
</p>
</div>
</div>

<div id="outline-container-org3b24c73" class="outline-3">
<h3 id="org3b24c73">Prerequisites</h3>
<div class="outline-text-3" id="text-org3b24c73">
<p>
The formal requirements of this course are <i>CAS CS 320: Concepts of
Programming Languages</i> and <i>CAS CS 210: Computer Systems</i>.  You'll
have the best time with this course if you took CS320 during the Fall
2024 semester.  It is not strictly a requirement, but if you didn't,
then you'll have to catch up a bit on the type theory part of the
course. We'll have a crash course on this after the spring recess, but
it will likely take some time and effort outside of class to master
this material.  Ideally, we should be able to create groups in which
at least one member has this experience.
</p>

<p>
The dependence on 210 is quite mild.  You need to be comfortable with
the terminal, and you need to have some sense of low-level memory
management.  That said, the more versed you are in systems, more
you'll get out of learning Rust.
</p>
</div>
</div>
