Syllabus/syllabus.org
** Learning Outcomes

+ Learn the rudiments of Rust, a notoriously difficult but ultimately
  rewarding low-level programming language
+ Better understand the use-cases of Rust, when it works well, when it
  doesn't
+ Identify the pitfalls of Rust programming and determine how to avoid them
+ Learn to read/practice reading academic papers
+ Learn to read/practice reading formal specifications of programming languages
+ Implement an interpreter for a subset of Rust in Rust
+ Prove properties like progress and preservation for a formal
  specification of Rust (properties which make Rust a "well-designed"
  programming language)

* Evaluation
The grade breakdown for this course is as follows

#+ATTR_LATEX: :align |l|l|
|-----+----------------------------------|
| 30% | Assignments (5% each, 2 dropped) |
| 40% | Final Project (10% each part)    |
| 20% | Midterm Exam                     |
| 10% | Participation                    |
|-----+----------------------------------|

** Assignments

During the first part of the course, there will be weekly programming
assignments, made up either of (1) a collection of programming
exercises or (2) a small tool you'll need to build in Rust.  There are
8 assignments total.  Two of your lowest assignment grades will be
dropped.

The assignments will be somewhat long but, as was mentioned above, we
will work on them during lecture in a group setting.  The hope is that
you'll be able to finish most of the assignment during lecture.

** Midterm Exam

The midterm exam will be held on Thursday March 6th during class.
This is right before the spring recess so plan accordingly.  The exam
will be on the fundamentals of Rust.  I don't expect it too be
difficult, it is meant to ensure that you are ready to build a large
program in Rust during the second half of the semester.

** Final Project

The bulk of the grade in this course will be dedicated to the final
project.  As mentioned above, the final project is an interpreter for
a subset of Rust written in Rust.  There will be 4 parts to the
project

+ A parser
+ An evaluator
+ A type/borrow checker
+ An extension of your choosing

#+LATEX: \noindent
You will expected to submit your own work but, as with the
assignments, you will also be expected to work in a small group and
complete much of the project during lecture.  More will be released
during after the spring recess.

** Participation
This part of your grade will be determined by your lecture attendance
and your pre-lecture quizzes.
* Course Resources

The resources we'll use for this course are standard.  Feel free to
reach out directly if you have questions.

All course material will be made available on the course website.
Please check it frequently.

/A personal note./ I'm putting some stricter boundaries on course
communication for myself this semester.  I will not respond to
anything (emails, Piazza posts, etc.) between the hours of
8:00PM-8:00AM.

** Piazza

For course communication, we'll use Piazza.  Please check it
frequently for announcements about deadlines, errata, office hours,
etc.  And if you have a question about course material, please ask it
on Piazza, ideally publicly.  I will not respond to emails about
course material.  A couple basic Piazza policies:


+ *Don't ask homework questions directly.* Formulate a question which
  will aid in your understanding, and will hopefully help others as
  well.
+ *Don't give homework solutions directly.* The answer-provider is
  just as culpable as the answer-receiver in cases of cheating.
+ Piazza is as useful as it is active. I'll be answering questions on
  Piazza, but don't hesitate to answer questions yourself.

** Gradescope

All assignments and project check-ins will be submitted via
Gradescope.  If you're unfamiliar with Gradescope, see their
[[https://www.gradescope.com/get_started][get-started page]] for information and tutorials.  I will not be setting
up autograders this semester, I'll be reading code by hand.[fn::So, in
particular, don't give my bullsh** code.  If I feel like you code was
generated, it will be investigated for cheating.]

* Policies
** Collaboration
As mentioned above, there's going to be a lot of group work in this
course.  My collaboration policy is pretty simple: work in groups,
talk about solutions, but *never* send someone your work, copy-paste
your work, or let someone copy your work.  I will be checking for
code-similarity, and notable cases will be investigated.  If you
collaborate with someone you *must* cite this in your own work.  See
the next section for more details.

