Syllabus/syllabus.html

<div id="outline-container-orgdccc61f" class="outline-3">
<h3 id="orgdccc61f">Learning Outcomes</h3>
<div class="outline-text-3" id="text-orgdccc61f">
<ul class="org-ul">
<li>Learn the rudiments of Rust, a notoriously difficult but ultimately
rewarding low-level programming language</li>
<li>Better understand the use-cases of Rust, when it works well, when it
doesn't</li>
<li>Identify the pitfalls of Rust programming and determine how to avoid them</li>
<li>Learn to read/practice reading academic papers</li>
<li>Learn to read/practice reading formal specifications of programming languages</li>
<li>Implement an interpreter for a subset of Rust in Rust</li>
<li>Prove properties like progress and preservation for a formal
specification of Rust (properties which make Rust a "well-designed"
programming language)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga54e438" class="outline-2">
<h2 id="orga54e438">Evaluation</h2>
<div class="outline-text-2" id="text-orga54e438">
<p>
The grade breakdown for this course is as follows
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">30%</td>
<td class="org-left">Assignments (5% each, 2 dropped)</td>
</tr>

<tr>
<td class="org-right">40%</td>
<td class="org-left">Final Project (10% each part)</td>
</tr>

<tr>
<td class="org-right">20%</td>
<td class="org-left">Midterm Exam</td>
</tr>

<tr>
<td class="org-right">10%</td>
<td class="org-left">Participation</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orga21b5a7" class="outline-3">
<h3 id="orga21b5a7">Assignments</h3>
<div class="outline-text-3" id="text-orga21b5a7">
<p>
During the first part of the course, there will be weekly programming
assignments, made up either of (1) a collection of programming
exercises or (2) a small tool you'll need to build in Rust.  There are
8 assignments total.  Two of your lowest assignment grades will be
dropped.
</p>

<p>
The assignments will be somewhat long but, as was mentioned above, we
will work on them during lecture in a group setting.  The hope is that
you'll be able to finish most of the assignment during lecture.
</p>
</div>
</div>

<div id="outline-container-orgc7f07f4" class="outline-3">
<h3 id="orgc7f07f4">Midterm Exam</h3>
<div class="outline-text-3" id="text-orgc7f07f4">
<p>
The midterm exam will be held on Thursday March 6th during class.
This is right before the spring recess so plan accordingly.  The exam
will be on the fundamentals of Rust.  I don't expect it too be
difficult, it is meant to ensure that you are ready to build a large
program in Rust during the second half of the semester.
</p>
</div>
</div>

<div id="outline-container-org28d33a8" class="outline-3">
<h3 id="org28d33a8">Final Project</h3>
<div class="outline-text-3" id="text-org28d33a8">
<p>
The bulk of the grade in this course will be dedicated to the final
project.  As mentioned above, the final project is an interpreter for
a subset of Rust written in Rust.  There will be 4 parts to the
project
</p>

<ul class="org-ul">
<li>A parser</li>
<li>An evaluator</li>
<li>A type/borrow checker</li>
<li>An extension of your choosing</li>
</ul>

<p>
You will expected to submit your own work but, as with the
assignments, you will also be expected to work in a small group and
complete much of the project during lecture.  More will be released
during after the spring recess.
</p>
</div>
</div>

<div id="outline-container-org9b13634" class="outline-3">
<h3 id="org9b13634">Participation</h3>
<div class="outline-text-3" id="text-org9b13634">
<p>
This part of your grade will be determined by your lecture attendance
and your pre-lecture quizzes.
</p>
</div>
</div>
</div>
<div id="outline-container-org3d14f29" class="outline-2">
<h2 id="org3d14f29">Course Resources</h2>
<div class="outline-text-2" id="text-org3d14f29">
<p>
The resources we'll use for this course are standard.  Feel free to
reach out directly if you have questions.
</p>

<p>
All course material will be made available on the course website.
Please check it frequently.
</p>

<p>
<i>A personal note.</i> I'm putting some stricter boundaries on course
communication for myself this semester.  I will not respond to
anything (emails, Piazza posts, etc.) between the hours of
8:00PM-8:00AM.
</p>
</div>

<div id="outline-container-orgfd4ac10" class="outline-3">
<h3 id="orgfd4ac10">Piazza</h3>
<div class="outline-text-3" id="text-orgfd4ac10">
<p>
For course communication, we'll use Piazza.  Please check it
frequently for announcements about deadlines, errata, office hours,
etc.  And if you have a question about course material, please ask it
on Piazza, ideally publicly.  I will not respond to emails about
course material.  A couple basic Piazza policies:
</p>


<ul class="org-ul">
<li><b>Don't ask homework questions directly.</b> Formulate a question which
will aid in your understanding, and will hopefully help others as
well.</li>
<li><b>Don't give homework solutions directly.</b> The answer-provider is
just as culpable as the answer-receiver in cases of cheating.</li>
<li>Piazza is as useful as it is active. I'll be answering questions on
Piazza, but don't hesitate to answer questions yourself.</li>
</ul>
</div>
</div>

<div id="outline-container-orgde62021" class="outline-3">
<h3 id="orgde62021">Gradescope</h3>
<div class="outline-text-3" id="text-orgde62021">
<p>
All assignments and project check-ins will be submitted via
Gradescope.  If you're unfamiliar with Gradescope, see their
<a href="https://www.gradescope.com/get_started">get-started page</a> for information and tutorials.  I will not be setting
up autograders this semester, I'll be reading code by hand.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
</div>
</div>
</div>

<div id="outline-container-org970e210" class="outline-2">
<h2 id="org970e210">Policies</h2>
<div class="outline-text-2" id="text-org970e210">
</div>
<div id="outline-container-org23b0e06" class="outline-3">
<h3 id="org23b0e06">Collaboration</h3>
<div class="outline-text-3" id="text-org23b0e06">
<p>
As mentioned above, there's going to be a lot of group work in this
course.  My collaboration policy is pretty simple: work in groups,
talk about solutions, but <b>never</b> send someone your work, copy-paste
your work, or let someone copy your work.  I will be checking for
code-similarity, and notable cases will be investigated.  If you
collaborate with someone you <b>must</b> cite this in your own work.  See
the next section for more details.
</p>
</div>
</div>
